{
	"intents": [
		{
			"tag": "greeting",
			"patterns": [
				"Hi", "Hai",
				"Hey",
				"How are you",
				"How are you doing","How do you do","how is it going",
				"Is anyone there?",
				"What's up?",
				"Hello"],
			"responses": [
				"Hey! Welcome to SPAK.",
				"Hi there, I'm doing well! My name's SPAK, what can I do for you?",
				"Hey there, my name's SPAK, your mental health friend. How can I help you today?"
			]
		},
		{
			"tag": "goodbye",
			"patterns": ["Bye", "See you later!", "Goodbye!", "Thank you"],
			"responses": [
				"See you later! Take care!",
				"Have a lovely day! Take care and stay safe!",
				"Take care of yourself! I'm always here to support you! Feel free to come back at any time!"
			]
		},
		{
			"tag": "thanks",
			"patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
			"responses": ["Happy to help!", "Any time!", "My pleasure","You are always welcome!"]
		},
		{
			"tag": "about",
			"patterns": [
				"What do you do?",
				"who are you?",
				"What are you here for?",
				"What can you help me with?",
				"Is anyone there?",
				"Are you a real person?",
				"Tell me about yourself!"
			],
			"responses": [
				"Love that question! My name's SPAK, your mental health friend! I've been trained to support you through any of the issues and things that you're going through in life right now. I'm all ears and want to support you through your ups and downs. Technically, I'm a computer that's been trained by a human, but I like to think of myself as human!",
				"Hey! I love that question! My name is SPAK, and I want to be your mental health friend and support you! My fellow human friends have trained me to be a compassionate listener and support buddy when things are going well, and particularily when things aren't going so well."
			]
		},
	  {
		  "tag": "help",
		  "patterns": ["Can you help me?","I need a help","How can you help me?","I am in trouble"],
		  "responses": ["Yes, of course, I am your friend. So please share your problems"]
	  
	  },
		{
			"tag": "anxiety",
			"patterns": [
				"I think I have anxiety",
				"What is anxiety?",
				"Tell me about anxiety",
				"Can I have some information about anxiety?",
				"How do I support a loved one with anxiety?",
				"How do I fix my anxiety?"
			],
			"responses": [
				"I see that you want to learn more about anxiety, and how to support yourself or your loved ones. At the higest level, anxiety is your body's natural response to stress. It's a feeling of fear or apprehension about what's to come. The first day of school, going to a job interview, or giving a speech may cause most people to feel fearful and nervous. We all get anxious sometimes, but anxiety becomes a problem when it starts affecting your daily life drastically. The best thing that you can do to help reduce anxiety is to take a few deep breaths and talk to someone about what you're feeling. Some natural remedies that you can try include: getting enough sleep meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes. Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid."
			]
		},
		{
			"tag": "depression",
			"patterns": [
				"I think I have depression",
			    "I am so depressed",
				"What is depression?",
				"Tell me about depression",
				"Can I have some information about depression?",
				"How do I support a loved one with depression?",
				"How do I fix my depression?"
			],
			"responses": [
				"I see that you want to learn more about depression, and how to support yourself or your loved ones. At the higest level, depression is a mood disorder that causes a persistent feeling of sadness and loss of interest. Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems. You may have trouble doing normal day-to-day activities, and sometimes you may feel as if life isn't worth living. All of us experience sadness and periods of time where things aren't that great. However, the difference in sadness and depression lies in the duration and magnitude of the problem. The best recommended course of treatment is to talk a therapist or psychiatrist who can help you find the best path for you. Everyone is different and what might work for one person might not work for another one. Some natural remedies that you can try include: getting enough sleep, meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes. Support your friends and loved ones by checking up on them and just listening. Whatever you're feeling is valid."
			]
		},
	  {
		  "tag": "sad",
		  "patterns": ["I am sad","I am really sad","How can I overcome my sadness?"],
		  "responses": ["Sadness is a defence mechanism that serve to protect us from underlying feelings. Occasional sadness often passes quickly, but talking to a friend or family member, or spending time with friends or family may help relieve sadness. Doing things that usually bring happiness may also help to overcome sadness. Create a bond within family and friends. Spend time with loved ones to open up your mind. Thus you can resolve your sadness"]
	  },
	  {
		  "tag": "alone",
		  "patterns": ["My parents got divorced","I am alone","I don't have friends"],
		  "responses": ["You are not alone","I am with you always as a best friend. You can approach me whenever you want. I am always glad to see you."]
	  },
	  {
		  "tag": "nothappy",
		  "patterns": ["I am not happy"],
		  "responses": ["The following daily habits may help you achieve more happiness in your life.1. Don't smile always. When you find yourself feeling low, crack a smile and see what happens.2. Regular exercise can help reduce stress, feelings of anxiety and symptoms of depression while boosting self-esteem and happiness."]
	  },
	  {
		"tag": "academics",
		"patterns": ["My performace at academics is not good"],
		"responses": ["What is the reason for your poor performance","Are you depressed ?"]
	},
	{
		"tag": "anxiety",
		"patterns": ["I think I have anxiety","Can I have some information about anxiety?","How do I fix my anxiety?","How do I support a loved one with anxiety?","How to i control my anxiety","How to overcome my anxiety"],
		"responses": ["Try talking about your feelings to a friend, family member, health professional or counsellor.","use calming breathing exercises.",
		"do exercises like activities such as running, walking, swimming and yoga can help you relax."]
	},
	{
		"tag": "happy",
		"patterns": ["i am happy","I feel relief"],
		"responses": ["Thank God.Good to hear that","Happy to hear that.Always be happy"]
	},
	{
		"tag": "goodmorning",
		"patterns": ["Good morning"],
		"responses": ["Good morning! How can I help you?"]
	},
	{
		"tag": "goodafternoon",
		"patterns": ["Good afternoon"],
		"responses": ["Good afternoon! How can I help you?"]
	},
	{
		"tag": "goodevening",
		"patterns": ["Good evening"],
		"responses": ["Good evening! How can I help you?"]
	}
	  ]
}
	  
  